src/Documents/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Затраты</name>
  <basedOn>Document.Заявка</basedOn>
  <registerRecords>AccumulationRegister.РН_Анализ_Возможности_Затрат</registerRecords>
  <registerRecords>InformationRegister.ЦеныМагазинов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ТранспортныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.РН_МестаНакопленияДенег</registerRecords>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснМестоСклад</name>
    <type>
      <types>CatalogRef.Места_Объекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОплаты</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Семья</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьГСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонПокупки</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокИсточникаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВизЗатрат</name>
    <type>
      <types>EnumRef.ВидЗатрат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗатрат</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектПлатежа</name>
      <type>
        <types>CatalogRef.ДомашниеЖивотные</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Места_Объекты</types>
        <types>String</types>
        <types>CatalogRef.Люди</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Семья</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПлатежа</name>
      <comment>Зачем. дял чего во имя чего покупка</comment>
      <type>
        <types>CatalogRef.Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>Ценность</name>
      <type>
        <types>CatalogRef.Ценность</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Места_Объекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснЕдИзмерения</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолВоСравнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.ГруппаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзмСравнения</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <basedOn>Catalog.Номенклатура</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОснЕдИзмерения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФирмаПроизводитель</name>
    <type>
      <types>CatalogRef.Производители</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзмСравнения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВоСравнения</name>
    <comment>в кг.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ценность</name>
    <type>
      <types>CatalogRef.Ценность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельПлатежа</name>
    <type>
      <types>CatalogRef.Цели</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.ГруппаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПлатежа</name>
    <type>
      <types>CatalogRef.ДомашниеЖивотные</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Места_Объекты</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВРазныхТарах</name>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолВУпак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Описание</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Свойства</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ДопСвойстваНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Затраты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокЗаказаЦенаПриИзменении(Элемент)
	ПодсчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказаКоличествоПриИзменении(Элемент)
	ПодсчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ПодсчетСуммы()
	 ЭлТаб=Элементы.СписокЗаказа.ТекущиеДанные;
	 ЭлТаб.Сумма=ЭлТаб.Цена* ЭлТаб.Количество;
 КонецПроцедуры      // ПодсчетСуммы()

&НаКлиенте
Процедура СписокЗаказаНоменклатураПриИзменении(Элемент)
	Тел = Элементы.СписокЗаказа.ТекущиеДанные;
	Тел.Склад  = Объект.ОснМестоСклад;

	//ЭлТаб.Цена = ПолучениеЦены(ЭлТаб.Номенклатура);//, Объект.Контрагент);
	ПодсчетСуммы();
	УстановкаВидимостиЭлементовСписокЗаказа_ПРОБЕГ(ВозвратГруппыНоменклатуры(Тел.Номенклатура));
	
	СтрНом = Новый Структура("Номенклатура,Ценность,ЦельПлатежа,ГруппаНоменклатуры,ОбъектПлатежа,КолВоСравнения,ЕдИзмСравнения,ОснЕдИзмерения");
	СтрНом.Номенклатура  =  Тел.Номенклатура;
	ОбращБД.ЗаполнениеДопСвойствНоменклатуры(СтрНом);
	ЗаполнитьЗначенияСвойств(Тел,СтрНом);
	
	//Фокус на форме
	
 КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозвратГруппыНоменклатуры(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Родитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РЗ = Запрос.Выполнить();
	ВЗ = РЗ.Выбрать();
	ВЗ.Следующий(); 
	Возврат   ВЗ.Родитель;
КонецФункции 

&НаКлиенте
Процедура СписокЗаказаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Тел = Элементы.СписокЗаказа.ТекущиеДанные;
	//		
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказаСуммаПриИзменении(Элемент)
	Тел = Элементы.СписокЗаказа.ТекущиеДанные;
	Если Тел.Количество>0 Тогда
		Тел.Цена = Тел.Сумма/Тел.Количество	;
	Иначе
		Тел.Количество = Тел.Сумма/Тел.Цена	;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.СписокЗаказаПробег.Видимость = Ложь;
	УстановкаВидимостиЭлементовСписокЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаВидимостиЭлементовСписокЗаказа()
	Если  ЭтаФорма.Параметры.Ключ.Пустая() Тогда
	КонецЕсли; 	
	
	Если Объект.ЕстьГСМ Тогда
		Элементы.СписокЗаказаПробег.Видимость = Истина;
	Иначе
		Элементы.СписокЗаказаПробег.Видимость = ЛОЖЬ;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УстановкаВидимостиЭлементовСписокЗаказа_ПРОБЕГ(ГруппаНоменкл)
	Если ГруппаНоменкл = Справочники.Номенклатура.НайтиПоНаименованию("ГСМ",Истина) Тогда
		Объект.ЕстьГСМ = Истина;
		Элементы.СписокЗаказаПробег.Видимость = Истина;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ИсточникОплатыПриИзменении(Элемент)
	СтруктЗапроса =  ОбращБД.ИсточникОплатыПриИзмененииНаСервере(Объект.ИсточникОплаты);
	ЗаполнитьЗначенияСвойств(Объект,СтруктЗапроса);
	
	//Объект.Плательщик = СтруктЗапроса.
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьТоварПоСкидке(Команда)
	ПересчитатьСкидку();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСкидку()
	//ТЧ.Объект
КонецПроцедуры


&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СписокЗаказаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.КонтрагентМесто") Тогда
		СтандартнаяОбработка = Ложь;
		ПарамФормы = новый Структура("Отбор",Новый структура("Район",Объект.РайонПокупки));
		ОпиасниеОпов = Новый ОписаниеОповещения("ПослеЗакрытияВыборкаКонтрагента",ЭтотОбъект);
		ОткрытьФорму("Справочник.КонтрагентМесто.ФормаВыбора",ПарамФормы,ЭтаФорма,,,,ОпиасниеОпов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗакрытияВыборкаКонтрагента(ПараметрыВыбора,Параметры) Экспорт
	 ОБъект.Контрагент = ПараметрыВыбора;
КонецПроцедуры
